// =========================================================
// ステート
// =========================================================
const state = {
  code: null,
}

// =========================================================
// ミューテーション
// =========================================================
const mutations = {
  /**
   * エラーコードをセットする
   *
   * @param state 状態
   * @param code エラーコード
   */
  setCode(state, code) {
    state.code = code
  },
}

export default {
  namespaced: true,
  state,
  mutations,
}
