<!--==========================================================================-->
<!-- ローディング時に表示されるアイコン -->
<!--==========================================================================-->
<template>
  <div class="p-loading-icon"></div>
</template>

<script>
import { mapState } from 'vuex'

export default {
  // =========================================================
  // 算出プロパティ
  // =========================================================
  computed: {
    /**
     * ストアからstateを取得する
     */
    ...mapState({
      // ページローディング
      loading: state => state.global.pageLoading,
    }),
  },
}
</script>
