<!--==========================================================================-->
<!-- 入力時のエラー -->
<!--==========================================================================-->
<template>
  <div v-if="errors && errors[name]">
    <div class="c-input-err">{{ errors[name][0] }}</div>
  </div>
</template>

<script>
export default {
  // =========================================================
  // 親から渡ってくる値
  // =========================================================
  props: {
    errors: { type: Object, default: null },
    name: { type: String, default: '' },
  },
}
</script>
